; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-15)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city7)
	(fuel-level plane1 fl4)
	(at plane2 city18)
	(fuel-level plane2 fl1)
	(at plane3 city14)
	(fuel-level plane3 fl4)
	(at plane4 city19)
	(fuel-level plane4 fl0)
	(at person1 city18)
	(at person2 city9)
	(at person3 city14)
	(at person4 city8)
	(at person5 city17)
	(at person6 city17)
	(at person7 city4)
	(at person8 city15)
	(at person9 city12)
	(at person10 city19)
	(at person11 city20)
	(at person12 city7)
	(at person13 city19)
	(at person14 city0)
	(at person15 city12)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city8)
	(at person2 city16)
	(at person3 city20)
	(at person4 city3)
	(at person5 city17)
	(at person6 city12)
	(at person7 city14)
	(at person8 city18)
	(at person9 city12)
	(at person10 city8)
	(at person11 city5)
	(at person12 city15)
	(at person13 city9)
	(at person14 city17)
	(at person15 city13)
	))

)

; plan
1. (refuel plane4 city19 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 2 of 15
2. (board person13 plane4 city19)
   deleted: (at person13 city19)
   added: (in person13 plane4)
   goals met: 2 of 15
3. (board person10 plane4 city19)
   deleted: (at person10 city19)
   added: (in person10 plane4)
   goals met: 2 of 15
4. (board person3 plane3 city14)
   deleted: (at person3 city14)
   added: (in person3 plane3)
   goals met: 2 of 15
5. (zoom plane3 city14 city20 fl4 fl3 fl2)
   deleted: (at plane3 city14) (fuel-level plane3 fl4)
   added: (at plane3 city20) (fuel-level plane3 fl2)
   goals met: 2 of 15
6. (debark person3 plane3 city20)
   deleted: (in person3 plane3)
   added: (at person3 city20)
   goals met: 3 of 15
7. (board person11 plane3 city20)
   deleted: (at person11 city20)
   added: (in person11 plane3)
   goals met: 3 of 15
8. (zoom plane3 city20 city5 fl2 fl1 fl0)
   deleted: (at plane3 city20) (fuel-level plane3 fl2)
   added: (at plane3 city5) (fuel-level plane3 fl0)
   goals met: 3 of 15
9. (debark person11 plane3 city5)
   deleted: (in person11 plane3)
   added: (at person11 city5)
   goals met: 4 of 15
10. (board person1 plane2 city18)
   deleted: (at person1 city18)
   added: (in person1 plane2)
   goals met: 4 of 15
11. (fly plane2 city18 city8 fl1 fl0)
   deleted: (at plane2 city18) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 4 of 15
12. (board person4 plane2 city8)
   deleted: (at person4 city8)
   added: (in person4 plane2)
   goals met: 4 of 15
13. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 4 of 15
14. (debark person1 plane2 city8)
   deleted: (in person1 plane2)
   added: (at person1 city8)
   goals met: 5 of 15
15. (fly plane2 city8 city3 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 5 of 15
16. (debark person4 plane2 city3)
   deleted: (in person4 plane2)
   added: (at person4 city3)
   goals met: 6 of 15
17. (board person12 plane1 city7)
   deleted: (at person12 city7)
   added: (in person12 plane1)
   goals met: 6 of 15
18. (zoom plane1 city7 city0 fl4 fl3 fl2)
   deleted: (at plane1 city7) (fuel-level plane1 fl4)
   added: (at plane1 city0) (fuel-level plane1 fl2)
   goals met: 6 of 15
19. (board person14 plane1 city0)
   deleted: (at person14 city0)
   added: (in person14 plane1)
   goals met: 6 of 15
20. (fly plane4 city19 city8 fl1 fl0)
   deleted: (at plane4 city19) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 6 of 15
21. (refuel plane4 city8 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 6 of 15
22. (debark person10 plane4 city8)
   deleted: (in person10 plane4)
   added: (at person10 city8)
   goals met: 7 of 15
23. (fly plane4 city8 city9 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl1)
   added: (at plane4 city9) (fuel-level plane4 fl0)
   goals met: 7 of 15
24. (board person2 plane4 city9)
   deleted: (at person2 city9)
   added: (in person2 plane4)
   goals met: 7 of 15
25. (refuel plane4 city9 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 7 of 15
26. (debark person13 plane4 city9)
   deleted: (in person13 plane4)
   added: (at person13 city9)
   goals met: 8 of 15
27. (zoom plane1 city0 city15 fl2 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl2)
   added: (at plane1 city15) (fuel-level plane1 fl0)
   goals met: 8 of 15
28. (refuel plane1 city15 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 15
29. (board person8 plane1 city15)
   deleted: (at person8 city15)
   added: (in person8 plane1)
   goals met: 8 of 15
30. (debark person12 plane1 city15)
   deleted: (in person12 plane1)
   added: (at person12 city15)
   goals met: 9 of 15
31. (fly plane1 city15 city17 fl1 fl0)
   deleted: (at plane1 city15) (fuel-level plane1 fl1)
   added: (at plane1 city17) (fuel-level plane1 fl0)
   goals met: 9 of 15
32. (refuel plane1 city17 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 15
33. (fly plane4 city9 city16 fl1 fl0)
   deleted: (at plane4 city9) (fuel-level plane4 fl1)
   added: (at plane4 city16) (fuel-level plane4 fl0)
   goals met: 9 of 15
34. (debark person2 plane4 city16)
   deleted: (in person2 plane4)
   added: (at person2 city16)
   goals met: 10 of 15
35. (board person6 plane1 city17)
   deleted: (at person6 city17)
   added: (in person6 plane1)
   goals met: 10 of 15
36. (debark person14 plane1 city17)
   deleted: (in person14 plane1)
   added: (at person14 city17)
   goals met: 11 of 15
37. (fly plane1 city17 city12 fl1 fl0)
   deleted: (at plane1 city17) (fuel-level plane1 fl1)
   added: (at plane1 city12) (fuel-level plane1 fl0)
   goals met: 11 of 15
38. (refuel plane4 city16 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 11 of 15
39. (refuel plane1 city12 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 11 of 15
40. (debark person6 plane1 city12)
   deleted: (in person6 plane1)
   added: (at person6 city12)
   goals met: 12 of 15
41. (board person15 plane1 city12)
   deleted: (at person15 city12)
   added: (in person15 plane1)
   goals met: 12 of 15
42. (fly plane4 city16 city4 fl1 fl0)
   deleted: (at plane4 city16) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 12 of 15
43. (board person7 plane4 city4)
   deleted: (at person7 city4)
   added: (in person7 plane4)
   goals met: 12 of 15
44. (refuel plane4 city4 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 12 of 15
45. (fly plane4 city4 city14 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city14) (fuel-level plane4 fl0)
   goals met: 12 of 15
46. (debark person7 plane4 city14)
   deleted: (in person7 plane4)
   added: (at person7 city14)
   goals met: 13 of 15
47. (fly plane1 city12 city13 fl1 fl0)
   deleted: (at plane1 city12) (fuel-level plane1 fl1)
   added: (at plane1 city13) (fuel-level plane1 fl0)
   goals met: 13 of 15
48. (refuel plane1 city13 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 13 of 15
49. (debark person15 plane1 city13)
   deleted: (in person15 plane1)
   added: (at person15 city13)
   goals met: 14 of 15
50. (fly plane1 city13 city18 fl1 fl0)
   deleted: (at plane1 city13) (fuel-level plane1 fl1)
   added: (at plane1 city18) (fuel-level plane1 fl0)
   goals met: 14 of 15
51. (debark person8 plane1 city18)
   deleted: (in person8 plane1)
   added: (at person8 city18)
   goals met: 15 of 15
